balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GA010.PIC
        <edc:AdjustPoint edc:offset="90"/>
        <edc:SFRDef edc:access="nn----nnnnnnnnnn" edc:cname="RCON" edc:desc="" edc:impl="0xc3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu----uuuuuuuuuu" edc:name="RCON" edc:nzwidth="0x10" edc:por="00----0000000011">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOR" edc:desc="" edc:mask="0x1" edc:name="BOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VREGS" edc:desc="" edc:mask="0x1" edc:name="VREGS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CM" edc:desc="" edc:mask="0x1" edc:name="CM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOPUWR" edc:desc="" edc:mask="0x1" edc:name="IOPUWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRAPR" edc:desc="" edc:mask="0x1" edc:name="TRAPR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="PMSLP" edc:desc="" edc:mask="0x1" edc:name="PMSLP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrr-nnnr-r-r-nn" edc:cname="OSCCON" edc:desc="" edc:impl="0x77ab" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-yyy00000000" edc:name="OSCCON" edc:nzwidth="0x10" edc:por="-000-yyy00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OSWEN" edc:desc="" edc:mask="0x1" edc:name="OSWEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSCEN" edc:desc="" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:desc="" edc:mask="0x1" edc:name="LOCK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLKLOCK" edc:desc="" edc:mask="0x1" edc:name="CLKLOCK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:desc="" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="COSC" edc:desc="" edc:mask="0x7" edc:name="COSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:desc="" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:desc="" edc:mask="0x1" edc:name="NOSC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC2" edc:desc="" edc:mask="0x1" edc:name="NOSC2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="COSC0" edc:desc="" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COSC1" edc:desc="" edc:mask="0x1" edc:name="COSC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COSC2" edc:desc="" edc:mask="0x1" edc:name="COSC2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LPOSCEN" edc:desc="" edc:mask="0x1" edc:name="LPOSCEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn--------" edc:cname="CLKDIV" edc:desc="" edc:impl="0x7f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000011--------" edc:name="CLKDIV" edc:nzwidth="0x10" edc:por="00000011--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="RCDIV" edc:desc="" edc:mask="0x7" edc:name="RCDIV" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="DOZEN" edc:desc="" edc:mask="0x1" edc:name="DOZEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOZE" edc:desc="" edc:mask="0x7" edc:name="DOZE" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ROI" edc:desc="" edc:mask="0x1" edc:name="ROI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="RCDIV0" edc:desc="" edc:mask="0x1" edc:name="RCDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCDIV1" edc:desc="" edc:mask="0x1" edc:name="RCDIV1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCDIV2" edc:desc="" edc:mask="0x1" edc:name="RCDIV2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DOZE0" edc:desc="" edc:mask="0x1" edc:name="DOZE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOZE1" edc:desc="" edc:mask="0x1" edc:name="DOZE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOZE2" edc:desc="" edc:mask="0x1" edc:name="DOZE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="OSCTUN" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000" edc:name="OSCTUN" edc:nzwidth="0x10" edc:por="----------000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TUN" edc:desc="" edc:mask="0x3f" edc:name="TUN" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUN0" edc:desc="" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN1" edc:desc="" edc:mask="0x1" edc:name="TUN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN2" edc:desc="" edc:mask="0x1" edc:name="TUN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN3" edc:desc="" edc:mask="0x1" edc:name="TUN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN4" edc:desc="" edc:mask="0x1" edc:name="TUN4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN5" edc:desc="" edc:mask="0x1" edc:name="TUN5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="22"/>
        <edc:SFRDef edc:access="snn------n--nnnn" edc:cname="NVMCON" edc:desc="" edc:impl="0xe04f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000------0--0000" edc:name="NVMCON" edc:nzwidth="0x10" edc:por="000------0--0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMOP" edc:desc="" edc:mask="0xf" edc:name="NVMOP" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ERASE" edc:desc="" edc:mask="0x1" edc:name="ERASE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NVMOP0" edc:desc="" edc:mask="0x1" edc:name="NVMOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMOP1" edc:desc="" edc:mask="0x1" edc:name="NVMOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMOP2" edc:desc="" edc:mask="0x1" edc:name="NVMOP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMOP3" edc:desc="" edc:mask="0x1" edc:name="NVMOP3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PROGOP" edc:desc="" edc:mask="0xf" edc:name="PROGOP" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PROGOP0" edc:desc="" edc:mask="0x1" edc:name="PROGOP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP1" edc:desc="" edc:mask="0x1" edc:name="PROGOP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP2" edc:desc="" edc:mask="0x1" edc:name="PROGOP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP3" edc:desc="" edc:mask="0x1" edc:name="PROGOP3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="--------wwwwwwww" edc:cname="NVMKEY" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="NVMKEY" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMKEY" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="NVMKEY" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:SFRDef edc:access="nnnnn---nnnnn--n" edc:cname="PMD1" edc:desc="" edc:impl="0xf8f9" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000---00000--0" edc:name="PMD1" edc:nzwidth="0x10" edc:por="00000---00000--0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1MD" edc:desc="" edc:mask="0x1" edc:name="ADC1MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1MD" edc:desc="" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="T1MD" edc:desc="" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2MD" edc:desc="" edc:mask="0x1" edc:name="T2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3MD" edc:desc="" edc:mask="0x1" edc:name="T3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4MD" edc:desc="" edc:mask="0x1" edc:name="T4MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5MD" edc:desc="" edc:mask="0x1" edc:name="T5MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rw" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="PMD2" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="PMD2" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OC1MD" edc:desc="" edc:mask="0x1" edc:name="OC1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC2MD" edc:desc="" edc:mask="0x1" edc:name="OC2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC3MD" edc:desc="" edc:mask="0x1" edc:name="OC3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC4MD" edc:desc="" edc:mask="0x1" edc:name="OC4MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC5MD" edc:desc="" edc:mask="0x1" edc:name="OC5MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IC1MD" edc:desc="" edc:mask="0x1" edc:name="IC1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC2MD" edc:desc="" edc:mask="0x1" edc:name="IC2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC3MD" edc:desc="" edc:mask="0x1" edc:name="IC3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC4MD" edc:desc="" edc:mask="0x1" edc:name="IC4MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC5MD" edc:desc="" edc:mask="0x1" edc:name="IC5MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rw" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnn-----n-" edc:cname="PMD3" edc:desc="" edc:impl="0x782" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0000-----0-" edc:name="PMD3" edc:nzwidth="0x10" edc:por="-----0000-----0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="I2C2MD" edc:desc="" edc:mask="0x1" edc:name="I2C2MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="CRCPMD" edc:desc="" edc:mask="0x1" edc:name="CRCPMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMPMD" edc:desc="" edc:mask="0x1" edc:name="PMPMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTCCMD" edc:desc="" edc:mask="0x1" edc:name="RTCCMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMPMD" edc:desc="" edc:mask="0x1" edc:name="CMPMD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:EmulatorSector edc:beginaddr="0xFD0000" edc:endaddr="0xfd003a" edc:regionid="emulreg"/>
      <edc:GPRDataSector edc:beginaddr="0x800" edc:endaddr="0x2800" edc:regionid="data"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!-- Pin 01 -->
      <edc:VirtualPin edc:name="RG15" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 02 -->
      <edc:VirtualPin edc:name="VDD" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 03 -->
      <edc:VirtualPin edc:name="PMD5" />
      <edc:VirtualPin edc:name="RE5" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 04 -->
      <edc:VirtualPin edc:name="PMD6" />
      <edc:VirtualPin edc:name="RE6" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 05 -->
      <edc:VirtualPin edc:name="PMD7" />
      <edc:VirtualPin edc:name="RE7" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 06 -->
      <edc:VirtualPin edc:name="T2CK" />
      <edc:VirtualPin edc:name="RC1" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 07 -->
      <edc:VirtualPin edc:name="T3CK" />
      <edc:VirtualPin edc:name="RC2" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 08 -->
      <edc:VirtualPin edc:name="T4CK" />
      <edc:VirtualPin edc:name="RC3" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 09 -->
      <edc:VirtualPin edc:name="T5CK" />
      <edc:VirtualPin edc:name="RC4" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 10 -->
      <edc:VirtualPin edc:name="PMA5" />
      <edc:VirtualPin edc:name="SCK2" />
      <edc:VirtualPin edc:name="CN8" />
      <edc:VirtualPin edc:name="RG6" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 11 -->
      <edc:VirtualPin edc:name="PMA4" />
      <edc:VirtualPin edc:name="SDI2" />
      <edc:VirtualPin edc:name="CN9" />
      <edc:VirtualPin edc:name="RG7" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 12 -->
      <edc:VirtualPin edc:name="PMA3" />
      <edc:VirtualPin edc:name="SDO2" />
      <edc:VirtualPin edc:name="CN10" />
      <edc:VirtualPin edc:name="RG8" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 13 -->
      <edc:VirtualPin edc:name="MCLR" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 14 -->
      <edc:VirtualPin edc:name="PMA2" />
      <edc:VirtualPin edc:name="SS2" />
      <edc:VirtualPin edc:name="CN11" />
      <edc:VirtualPin edc:name="RG9" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 15 -->
      <edc:VirtualPin edc:name="VSS" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 16 -->
      <edc:VirtualPin edc:name="VDD" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 17 -->
      <edc:VirtualPin edc:name="TMS" />
      <edc:VirtualPin edc:name="RA0" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 18 -->
      <edc:VirtualPin edc:name="INT1" />
      <edc:VirtualPin edc:name="RE8" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 19 -->
      <edc:VirtualPin edc:name="INT2" />
      <edc:VirtualPin edc:name="RE9" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 20 -->
      <edc:VirtualPin edc:name="C1IN+" />
      <edc:VirtualPin edc:name="AN5" />
      <edc:VirtualPin edc:name="CN7" />
      <edc:VirtualPin edc:name="RB5" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 21 -->
      <edc:VirtualPin edc:name="C1IN-" />
      <edc:VirtualPin edc:name="AN4" />
      <edc:VirtualPin edc:name="CN6" />
      <edc:VirtualPin edc:name="RB4" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 22 -->
      <edc:VirtualPin edc:name="C2IN+" />
      <edc:VirtualPin edc:name="AN3" />
      <edc:VirtualPin edc:name="CN5" />
      <edc:VirtualPin edc:name="RB3" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 23 -->
      <edc:VirtualPin edc:name="C2IN-" />
      <edc:VirtualPin edc:name="AN2" />
      <edc:VirtualPin edc:name="SS1" />
      <edc:VirtualPin edc:name="CN4" />
      <edc:VirtualPin edc:name="RB2" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 24 -->
      <edc:VirtualPin edc:name="PGC1" />
      <edc:VirtualPin edc:name="EMUC1" />
      <edc:VirtualPin edc:name="AN1" />
      <edc:VirtualPin edc:name="CN3" />
      <edc:VirtualPin edc:name="RB1" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 25 -->
      <edc:VirtualPin edc:name="PGD1" />
      <edc:VirtualPin edc:name="EMUD1" />
      <edc:VirtualPin edc:name="AN0" />
      <edc:VirtualPin edc:name="CN2" />
      <edc:VirtualPin edc:name="RB0" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 26 -->
      <edc:VirtualPin edc:name="PGC2" />
      <edc:VirtualPin edc:name="EMUC2" />
      <edc:VirtualPin edc:name="AN6" />
      <edc:VirtualPin edc:name="RB7" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 27 -->
      <edc:VirtualPin edc:name="PGD2" />
      <edc:VirtualPin edc:name="EMUD2" />
      <edc:VirtualPin edc:name="AN7" />
      <edc:VirtualPin edc:name="RB7" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 28 -->
      <edc:VirtualPin edc:name="PMA7" />
      <edc:VirtualPin edc:name="VREF-" />
      <edc:VirtualPin edc:name="RA9" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 29 -->
      <edc:VirtualPin edc:name="PMA6" />
      <edc:VirtualPin edc:name="VREF+" />
      <edc:VirtualPin edc:name="RA10" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 30 -->
      <edc:VirtualPin edc:name="AVDD" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 31 -->
      <edc:VirtualPin edc:name="AVSS" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 32 -->
      <edc:VirtualPin edc:name="C1OUT" />
      <edc:VirtualPin edc:name="AN8" />
      <edc:VirtualPin edc:name="RB8" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 33 -->
      <edc:VirtualPin edc:name="C2OUT" />
      <edc:VirtualPin edc:name="AN9" />
      <edc:VirtualPin edc:name="RB9" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 34 -->
      <edc:VirtualPin edc:name="PMA13" />
      <edc:VirtualPin edc:name="CVREF" />
      <edc:VirtualPin edc:name="AN10" />
      <edc:VirtualPin edc:name="RB10" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 35 -->
      <edc:VirtualPin edc:name="PMA12" />
      <edc:VirtualPin edc:name="AN11" />
      <edc:VirtualPin edc:name="RB11" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 36 -->
      <edc:VirtualPin edc:name="VSS" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 37 -->
      <edc:VirtualPin edc:name="VDD" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 38 -->
      <edc:VirtualPin edc:name="TCK" />
      <edc:VirtualPin edc:name="RA1" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 39 -->
      <edc:VirtualPin edc:name="U2RTS" />
      <edc:VirtualPin edc:name="BLCK2" />
      <edc:VirtualPin edc:name="RF13" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 40 -->
      <edc:VirtualPin edc:name="U2CTS" />
      <edc:VirtualPin edc:name="RF12" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 41 -->
      <edc:VirtualPin edc:name="PMA11" />
      <edc:VirtualPin edc:name="AN12" />
      <edc:VirtualPin edc:name="RB12" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 42 -->
      <edc:VirtualPin edc:name="PMA10" />
      <edc:VirtualPin edc:name="AN13" />
      <edc:VirtualPin edc:name="RB13" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 43 -->
      <edc:VirtualPin edc:name="PMA1" />
      <edc:VirtualPin edc:name="AN14" />
      <edc:VirtualPin edc:name="RB14" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 44 -->
      <edc:VirtualPin edc:name="PMA0" />
      <edc:VirtualPin edc:name="AN15" />
      <edc:VirtualPin edc:name="OCFB" />
      <edc:VirtualPin edc:name="CN12" />
      <edc:VirtualPin edc:name="RB15" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 45 -->
      <edc:VirtualPin edc:name="VSS" />
    </edc:Pin>
    <edc:Pin>
      <!-- Pin 46 -->
      <edc:VirtualPin edc:name="VDD" />
    </edc:Pin>
